In [1]:
import pandas as pd
import numpy as np
import scipy 
from scipy import stats
import statsmodels.api as sm
import statsmodels.stats.descriptivestats as sd
import warnings
warnings.filterwarnings("ignore")
#pip install chart_studio.plotly     -   run this command if you're getting error "No module named plotly"
import chart_studio.plotly as py
from plotly.tools import FigureFactory as FF
from statsmodels.formula.api import ols

In [2]:
import chart_studio.plotly as py

In [3]:
cutlets = pd.read_csv("C:\\Data science\\Data sets\\hypotest datasets\\Cutlets.csv")
cutlets.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [4]:
# renaming the columns
cutlets.columns = 'unitA','unitB'
cutlets.head()

    unitA   unitB
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [18]:
#problem , A F&B manager wants to determine whether there is any significant difference
#in the diameter of the cutlet between two units. A randomly selected sample of cutlets
#was collected from both units and measured? Analyze the data and draw inferences at 5% significance level. 
#Please state the assumptions and tests that you carried out to check validity of the assumptions
# normality testing
print(stats.shapiro(cutlets.dropna()['unitA']))
print(stats.shapiro(cutlets.dropna()['unitB']))

scipy.stats.ttest_ind(cutlets.dropna()['unitA'],cutlets.dropna()['unitB'],equal_var = True)

#unitA 0.31>0.05 -> Normal dis
#unitB 0.52>0.05 -> Normal dis

#Ttest 0.47 > 0.05 ->

ShapiroResult(statistic=0.9649458527565002, pvalue=0.3199819028377533)
ShapiroResult(statistic=0.9727300405502319, pvalue=0.5224985480308533)

Ttest_indResult(statistic=0.7228688704678061, pvalue=0.4722394724599501)

In [6]:
Lab = pd.read_csv("C:\\Data science\\Data sets\\hypotest datasets\\LabTAT.csv")
Lab.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [8]:
Lab.columns = 'lab1','lab2','lab3','lab4'
Lab.head()

     lab1    lab2    lab3    lab4
0  185.35  165.53  176.70  166.13
1  170.49  185.91  198.45  160.79
2  192.77  194.92  201.23  185.18
3  177.33  183.00  199.61  176.42
4  193.41  169.57  204.63  152.60

In [14]:
print(stats.shapiro(Lab.dropna()['lab1']))
print(stats.shapiro(Lab.dropna()['lab2']))
print(stats.shapiro(Lab.dropna()['lab3']))  #Normality test 
print(stats.shapiro(Lab.dropna()['lab4']))

# Variance test 
print(scipy.stats.levene(Lab.lab1, Lab.lab2))
print(scipy.stats.levene(Lab.lab2, Lab.lab3))
print(scipy.stats.levene(Lab.lab3, Lab.lab4)) # variance test 
print(scipy.stats.levene(Lab.lab4, Lab.lab1))

# molten convert
Molten = pd.melt(Lab)
Molten.columns = 'values','ind'
Molten
#one anova test 
mod=ols('ind ~ C(values)',data = Molten).fit()
mod.params
aov_table = sm.stats.anova_lm(mod, type = 2)
print(aov_table)

ShapiroResult(statistic=0.9901824593544006, pvalue=0.5506953597068787)
ShapiroResult(statistic=0.9936322569847107, pvalue=0.8637524843215942)
ShapiroResult(statistic=0.9886345267295837, pvalue=0.4205053448677063)
ShapiroResult(statistic=0.9913753271102905, pvalue=0.6618951559066772)

In [31]:
Buyer = pd.read_csv("C:\\Data science\\Data sets\\hypotest datasets\\BuyerRatio.csv")
Buyer

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [47]:
Buyer.columns = 'OB','East','West','North','South'
Buyer

        OB  East  West  North  South
0    Males    50   142    131     70
1  Females   435  1523   1356    750

In [51]:
Buyer.describe()
#Buyer.info()
#Buyer.dtypes

             East         West        North       South
count    2.000000     2.000000     2.000000    2.000000
mean   242.500000   832.500000   743.500000  410.000000
std    272.236111   976.514465   866.205807  480.832611
min     50.000000   142.000000   131.000000   70.000000
25%    146.250000   487.250000   437.250000  240.000000
50%    242.500000   832.500000   743.500000  410.000000
75%    338.750000  1177.750000  1049.750000  580.000000
max    435.000000  1523.000000  1356.000000  750.000000

In [35]:
data = [[50,142,131,70],[435,1523,1356,750]]
chi_result = scipy.stats.chi2_contingency(data)
chi_result

[[50, 142, 131, 70], [435, 1523, 1356, 750]]

In [5]:
custom = pd.read_csv("C:\\Data science\\Data sets\\hypotest datasets\\CostomerOrderForm.csv")
custom.columns= 'philp','indo','malta','india'
custom.head()

        philp        indo       malta       india
0  Error Free  Error Free   Defective  Error Free
1  Error Free  Error Free  Error Free   Defective
2  Error Free   Defective   Defective  Error Free
3  Error Free  Error Free  Error Free  Error Free
4  Error Free  Error Free   Defective  Error Free

In [4]:
cust = pd.read_excel("C:\\Users\\Kamal\\Desktop\\CustomOrder.xlsx")
cust.head()
my_tab = pd.crosstab(index=cust["Cat"],columns = cust["Country"])
my_tab

Country     India  Indonesia  Malta  Phillippines
Cat
Defective      20         33     31            29
Error Free    280        267    269           271

In [41]:
chisquare_result = scipy.stats.chi2_contingency(my_tab)
chisquare_result

(3.858960685820355,
 0.2771020991233135,
 3,
 array([[ 28.25,  28.25,  28.25,  28.25],
        [271.75, 271.75, 271.75, 271.75]]))

In [9]:
# porpotion test 
from statsmodels.stats.proportion import proportions_ztest
faltoons = pd.read_csv("C:\Data science\Data sets\hypotest datasets\Faltoons.csv")
faltoons.head()
faltcross = pd.crosstab(index=faltoons["Weekdays"], columns=faltoons["Weekend"])
faltcross

Weekend   Female  Male
Weekdays
Female       167   120
Male          66    47

In [48]:
faltoons1 = pd.read_csv("C:\\Users\\Kamal\\Desktop\\Faltoostest.csv")
faltoons1.columns = 'C1','C2'
faltoons1
faltcross2 = pd.crosstab(index = faltoons1["C1"],columns= faltoons1["C2"])
faltcross2

C2      Weekdays  Weekend
C1
Female       287      233
Male         113      167